---
kind: other
id: Methods.T:Autodesk.Revit.DB.Transaction
zh: 事务
source: html/fa185fce-a8e4-71e4-2b62-53fb83f5d304.htm
---
# Transaction Methods

**中文**: 事务

Commits all changes made to the model during the transaction.